"""
Common
"""

ERROR = "Извините, что-то пошло не так"

WE_ARE_WORKING = "Бот скоро запустится! Мы уже работаем!"

"""
User
"""
FAQ = """
Часто задаваемые вопросы

Часть 1: Общие вопросы и терминология

 Алгоритм работы: наш бот предоставляет доступ к различным моделям искусственного интеллекта, таким как GPT-4, GPT-4o mini и т.п.
 Искусственный интеллект( в дальнейшем - ИИ ) - ...
 Модель ИИ - ...
 Промпт - ...

Часть 2: Поддержка и обслуживание

 Как я могу получить поддержку?: Для решения всех вопросов обращайтесь в тех.поддержку: @itjget
 Как часто выходят обновления?: Наш бот постоянно улучшается и дорабатывается нашими сотрудниками, на основе ваших отзывов и жалоб

Часть 3: Покупка моделей ИИ и их использование

 Для выбора и дальнейшей покупки модели ИИ, необходимо написать команду /hub и следовать дальнейшим инструкциям
 Чтобы модель после покупки стала доступной для использования, необходимо использовать команду /choice и нажать кнопку "Обновить"


"""

GREETING_TEXT = 'Привет, я твой ИИ-помощник.\nЯ очень рад, что вы выбрали меня! <3'

HELP_TEXT = 'Сожалеем, что вы столкнулись с проблемой.\nПожалуйста, напишите нам: @Itjget'

MODEL_TEXT = 'Выберите модель ИИ которую вы хотите приобрести'

CHOICE_TEXT = 'Доступные для вас планы'

NOT_IN_DB_TEXT = "Пожалуйста, напишите /start \nЕсли ничего не поменялось сообщите нам /help"

BUY_TEXT = "Доступные для покупки модели:"
#Текст требует изменений бтв
INSTRUCTION = "Это информация о моделях ИИ которые ты продаешь"
"""
Admin
"""
