"""
Common
"""

ERROR = "Извините, что-то пошло не так"

WE_ARE_WORKING = "Бот скоро запустится! Мы уже работаем!"

"""
User
"""
FAQ = """
Каждый режим использует свою языковую модель. Чем лучше режим, тем дороже запрос. Цена
Для решения всех вопросов обращайтесь в чат поддержку: https://t.me/+hNOJ9VWB_1k2ZjI6\n\n
Изначально вам доступны 5 стартовых рублей, которые вы можете потратить на необходимую вам модель ИИ (модель ии можно выбрать в гланом меню).
В дальнейшем пополнить свой счет можно в меню или пригласив пользователей по вашей реферальной ссылке.


"""
LC_TEXT = """
Добро пожаловать в ваш личный кабинет! 🎄 
"""

MENU_TEXT = 'Меню'

GREETING_TEXT = 'Привет, я твой ИИ-помощник.\nЯ очень рад, что вы выбрали меня! <3'

HELP_TEXT = 'По вопросам можно обратиться в чат поддержки https://t.me/+hNOJ9VWB_1k2ZjI6'

MODEL_TEXT = 'Выберите модель ИИ которую вы хотите приобрести'

CHOICE_TEXT = 'Доступные для вас планы'

NOT_IN_DB_TEXT = "Пожалуйста, напишите /start \nЕсли ничего не поменялось сообщите нам /help"

BUY_TEXT = "Доступные для покупки модели:"

PAY_INFO = ("Пополнить баланс можно через СБП, по номеру 89083375199 Т-Банк с сообщением "
            "'ИИ-бот'. Ваш чек нужно отправить прямо сюда.\n\n") + HELP_TEXT


"""
Admin
"""
